config.org
* Start
** Early Initialization
The early initialization file is processed before the package system and graphical interface are initialized.
It is appropriate to configure these components via this file in order to avoid initialization of unused features.

This setting disables the built-in =package.el= in favor of the =straight.el= package manager (see below).
#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (setq package-enable-at-startup nil)
#+END_SRC

The =default-frame-alist= captures default values affecting frame creation.
Adjusting these values here speeds up creation of the initial frame.
#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars . nil) default-frame-alist)
  (push '(left-fringe . 4) default-frame-alist)
  (push '(right-fringe . 4) default-frame-alist)
#+END_SRC

** Garbage Collection
The following effectively disables garbage collection during application startup.
This works by increasing the memory threshold used to trigger automatic garbage collections.
The result is a significant decrease in startup time.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (setq
   gc-cons-threshold most-positive-fixnum
   gc-cons-percentage 0.6)
#+END_SRC

The =after-init-hook= below resets the garbage collection settings to reasonable values for interactive use.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (add-hook 'after-init-hook
    (lambda ()
      (setq
       gc-cons-threshold 16777216
       gc-cons-percentage 0.1)))
#+END_SRC

** Messages
These settings for =inhibit-startup-screen= and =initial-scratch-message= disable the startup splash screen and scratch buffer message respectively.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (setq inhibit-startup-screen t)
  (setq initial-scratch-message nil)
#+END_SRC

** Customizations
Despite aggressive use of =use-package= to manage customizations below, it is still useful to maintain a customization file.
Some of the uses include tracking themes that are considered safe as well as safe local variable-value pairs.
Since this file contains information specific to the host on which Emacs runs, store it outside of the configuration directory.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (setq custom-file "~/.emacs-custom.el")
  (load custom-file t)
#+END_SRC

* Packages
This project uses the functional package manager =straight.el=.
The primary reason is that it uses a version lockfile to ensure a fully reproducible environment.
By tracking this file in the  version control system, it is possible to revert to past states of the installed package collection.

The following commands are useful for managing packages with =straight.el=:
+ =straight-pull-package= pulls a single package from its primary remote
+ =straight-pull-all= pulls all packages from their primary remotes
+ =straight-freeze-versions= updates the package version lockfile
+ =straight-thaw-versions= restores packages to versions in the version lockfile

The following is the standard =straight.el= initialization boilerplate.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+END_SRC

Install =use-package=, a package that simplifies package installation and configuration with a macro of the same name.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (straight-use-package 'use-package)
#+END_SRC

The =straight-use-package-by-default= setting below ensures that =use-package= forms install their associated packages without an explicit directive.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package straight
    :custom
    (straight-use-package-by-default t))
#+END_SRC

Setting =use-package-verbose= causes =use-package= to print a message in the =*Messages*= buffer whenever a package is loaded.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package use-package
    :custom
    (use-package-verbose t))
#+END_SRC

The =no-littering= package consolidates various package-specific state files into a consistent directory structure.
It results in a cleaner =user-emacs-directory=.
This package should be loaded early in the configuration.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package no-littering
    :config
    (no-littering-theme-backups))
#+END_SRC

* Appearance
Calling =blink-cursor-mode= as follows disables blinking of the cursor.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (if (fboundp 'blink-cursor-mode)
      (blink-cursor-mode -1))
#+END_SRC

This default value for =cursor-in-non-selected-windows= hides the cursor in windows that are not selected.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (setq-default cursor-in-non-selected-windows nil)
#+END_SRC

The =beacon= package helps to find the location of the cursor when certain events occur such as switching windows or scrolling within a window.
It works by briefly flashing the line containing the cursor.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package beacon
    :custom
    (beacon-color 0.5)
    (beacon-size 80)
    (beacon-blink-duration 0.5)
    (beacon-blink-when-point-moves-vertically t)
    (beacon-blink-when-point-moves-horizontally t)
    (beacon-blink-when-buffer-changes t)
    (beacon-blink-when-window-scrolls t)
    (beacon-blink-when-window-changes t)
    (beacon-blink-when-focused t)
    :config
    (beacon-mode 1))
#+END_SRC

The global minor mode =global-hl-line-mode= highlights the line containing the point
This behavior will affect the selected window only (see the variable =global-hl-line-sticky-flag=).
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package hl-line
    :straight (:type built-in)
    :if window-system
    :custom
    (global-hl-line-sticky-flag nil)
    :config
    (global-hl-line-mode t))
#+END_SRC

The =dimmer= package provides the minor mode =dimmer-mode= which provides a visual indication of what buffer is currently active.
It works by muting the colors in all other visible buffers.
This configuration mutes both foreground and background colors (see =dimmer-adjustment-mode=).
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package dimmer
    :custom
    (dimmer-fraction 0.3)
    (dimmer-adjustment-mode :both)
    :init
    (dimmer-mode t))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (setq visible-bell t)
  (if (eq system-type 'darwin)
      (setq ring-bell-function 'ignore))

  (setq-default
   ;; only allow continuation lines in buffers that occupy the full frame width
   truncate-lines nil
   truncate-partial-width-windows t)

  ;; prefer horizontal splits
  (setq split-height-threshold 9999)

  (setq display-buffer-base-action
        '(display-buffer-reuse-mode-window
          display-buffer-reuse-window
          display-buffer-same-window))

  (use-package doom-modeline
    :hook
    (after-init . doom-modeline-mode)
    :custom
    (doom-modeline-bar-width 5)
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-buffer-file-name-style 'relative-from-project)
    (doom-modeline-env-enable-python t)
    (doom-modeline-height 20)
    (doom-modeline-icon nil)
    (doom-modeline-minor-modes nil))

  (use-package doom-themes
    :if window-system
    :custom
    (doom-themes-enable-bold nil)
    (doom-themes-enable-italic nil)
    :config
    (load-theme 'doom-solarized-light t))

  (use-package frame
    :straight (:type built-in)
    :bind
    ("M-RET" . toggle-frame-fullscreen))

  (use-package highlight-indentation
    :commands
    (highlight-indentation-mode
     highlight-indentation-current-column-mode))

  (use-package rainbow-delimiters
    :commands
    (rainbow-delimiters-mode))

  (use-package simple
    :straight (:type built-in)
    :config
    (line-number-mode t)
    (size-indication-mode t))

  ;; highlight buffer changes caused by certain commands
  (use-package volatile-highlights
    :defer 1
    :config
    (volatile-highlights-mode t))
#+END_SRC

* Environment
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package direnv
    :config
    (direnv-mode))

  (use-package dotenv-mode
    :defer t)

  (use-package exec-path-from-shell
    :if (eq system-type 'darwin)
    :custom
    (exec-path-from-shell-shell-name "/opt/homebrew/bin/zsh")
    (exec-path-from-shell-variables
     '("PATH"
       "MANPATH"
       "SSH_AGENT_PID"
       "SSH_AUTH_SOCK"))
    :config
    (exec-path-from-shell-initialize))

  (use-package keychain-environment
    :defer t
    :config
    (keychain-refresh-environment))
#+END_SRC

