config.el
;; [[file:config.org::*Garbage Collection][Garbage Collection:1]]
(setq
 gc-cons-threshold most-positive-fixnum
 gc-cons-percentage 0.6)
;; Garbage Collection:1 ends here

;; [[file:config.org::*Garbage Collection][Garbage Collection:2]]
(add-hook 'after-init-hook
  (lambda ()
    (setq
     gc-cons-threshold 16777216
     gc-cons-percentage 0.1)))
;; Garbage Collection:2 ends here

;; [[file:config.org::*Messages][Messages:1]]
(setq inhibit-startup-screen t)
(setq initial-scratch-message nil)
;; Messages:1 ends here

;; [[file:config.org::*Customizations][Customizations:1]]
(setq custom-file "~/.emacs-custom.el")
(load custom-file t)
;; Customizations:1 ends here

;; [[file:config.org::*Packages][Packages:1]]
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
;; Packages:1 ends here

;; [[file:config.org::*Packages][Packages:2]]
(straight-use-package 'use-package)
;; Packages:2 ends here

;; [[file:config.org::*Packages][Packages:3]]
(use-package straight
  :custom
  (straight-use-package-by-default t))
;; Packages:3 ends here

;; [[file:config.org::*Packages][Packages:4]]
(use-package use-package
  :custom
  (use-package-verbose t))
;; Packages:4 ends here

;; [[file:config.org::*Packages][Packages:5]]
(use-package no-littering)
;; Packages:5 ends here

;; [[file:config.org::*Appearance][Appearance:1]]
(if (fboundp 'blink-cursor-mode) (blink-cursor-mode -1))

(setq visible-bell t)
(if (eq system-type 'darwin)
    (setq ring-bell-function 'ignore))

(setq-default
 ;; only allow continuation lines in buffers that occupy the full frame width
 truncate-lines nil
 truncate-partial-width-windows t)

;; hide cursor in windows that are not selected
(setq-default cursor-in-non-selected-windows nil)

;; prefer horizontal splits
(setq split-height-threshold 9999)

(setq display-buffer-base-action
      '(display-buffer-reuse-mode-window
        display-buffer-reuse-window
        display-buffer-same-window))

(use-package beacon
  :config
  (beacon-mode 1))

(use-package dimmer
  :custom
  (dimmer-adjustment-mode :both)
  :init
  (dimmer-mode t))

(use-package doom-modeline
  :hook
  (after-init . doom-modeline-mode)
  :custom
  (doom-modeline-bar-width 5)
  (doom-modeline-buffer-encoding nil)
  (doom-modeline-buffer-file-name-style 'relative-from-project)
  (doom-modeline-env-enable-python t)
  (doom-modeline-height 20)
  (doom-modeline-icon nil)
  (doom-modeline-minor-modes nil))

(use-package doom-themes
  :if window-system
  :custom
  (doom-themes-enable-bold nil)
  (doom-themes-enable-italic nil)
  :config
  (load-theme 'doom-solarized-light t))

(use-package frame
  :straight (:type built-in)
  :bind
  ("M-RET" . toggle-frame-fullscreen))

(use-package highlight-indentation
  :commands
  (highlight-indentation-mode
   highlight-indentation-current-column-mode))

(use-package hl-line
  :if window-system
  :config
  (global-hl-line-mode t))

(use-package rainbow-delimiters
  :commands
  (rainbow-delimiters-mode))

(use-package simple
  :straight (:type built-in)
  :config
  (line-number-mode t)
  (size-indication-mode t))

;; highlight buffer changes caused by certain commands
(use-package volatile-highlights
  :defer 1
  :config
  (volatile-highlights-mode t))
;; Appearance:1 ends here

;; [[file:config.org::*Environment][Environment:1]]
(use-package direnv
  :config
  (direnv-mode))

(use-package dotenv-mode
  :defer t)

(use-package exec-path-from-shell
  :if (eq system-type 'darwin)
  :custom
  (exec-path-from-shell-shell-name "/opt/homebrew/bin/zsh")
  (exec-path-from-shell-variables
   '("PATH"
     "MANPATH"
     "SSH_AGENT_PID"
     "SSH_AUTH_SOCK"))
  :config
  (exec-path-from-shell-initialize))

(use-package keychain-environment
  :defer t
  :config
  (keychain-refresh-environment))
;; Environment:1 ends here
