config.org
* Projects
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package git-gutter-fringe
    :if window-system
    :defer t
    :config
    (define-fringe-bitmap 'git-gutter-fr:added [224]
      nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:modified [224]
      nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240]
      nil nil 'bottom)
    (set-face-foreground 'git-gutter-fr:added "#709080")
    (set-face-foreground 'git-gutter-fr:deleted "#cc9393")
    (set-face-foreground 'git-gutter-fr:modified "#f0dfaf")
    (global-git-gutter-mode t))

  (use-package git-messenger
    :bind
    ("C-x G" . git-messenger:popup-message)
    :custom
    (git-messenger:show-detail t)
    (git-messenger:use-magit-popup t))

  (use-package git-modes
    :straight (:host github :repo "magit/git-modes" :branch "main")
    :mode
    ("/\\.gitconfig\\'" . gitconfig-mode)
    ("/\\.git/config\\'" . gitconfig-mode)
    ("/\\.gitignore\\'" . gitignore-mode)
    ("/.dockerignore\\'" . gitignore-mode))

  (use-package git-timemachine
    :commands
    (git-timemachine
     git-timemachine-toggle))

  (use-package ibuffer-vc
    :config
    (add-hook 'ibuffer-hook (lambda ()
                              (ibuffer-vc-set-filter-groups-by-vc-root)
                              (unless (eq ibuffer-sorting-mode 'alphabetic)
                                (ibuffer-do-sort-by-alphabetic)))))

  (use-package magit
    :bind
    ("C-x g" . magit-status)
    ("C-x M-g" . magit-dispatch)
    :custom
    (git-commit-summary-max-length 72)
    (magit-repository-directories '(("~/projects/" . 1)))
    (magit-save-repository-buffers 'dontask)
    (magit-section-visibility-indicator nil)
    (magit-visit-ref-behavior '(create-branch checkout-any focus-on-ref))
    :config
    (add-to-list 'magit-no-confirm 'stage-all-changes))

  (use-package projectile
    :defer t
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :custom
    (projectile-use-git-grep t)
    (projectile-indexing-method 'alien)
    (projectile-project-search-path '("~/projects/"))
    (projectile-sort-order 'recentf)
    :config
    (projectile-mode +1))

  (use-package smerge-mode
    :after hydra
    :config
    (defhydra unpackaged/smerge-hydra
      (:color pink :hint nil :post (smerge-auto-leave))
      "
  ^Move^       ^Keep^               ^Diff^                 ^Other^
  ^^-----------^^-------------------^^---------------------^^-------
  _n_ext       _b_ase               _<_: upper/base        _C_ombine
  _p_rev       _u_pper              _=_: upper/lower       _r_esolve
  ^^           _l_ower              _>_: base/lower        _k_ill current
  ^^           _a_ll                _R_efine
  ^^           _RET_: current       _E_diff
  "
      ("n" smerge-next)
      ("p" smerge-prev)
      ("b" smerge-keep-base)
      ("u" smerge-keep-upper)
      ("l" smerge-keep-lower)
      ("a" smerge-keep-all)
      ("RET" smerge-keep-current)
      ("\C-m" smerge-keep-current)
      ("<" smerge-diff-base-upper)
      ("=" smerge-diff-upper-lower)
      (">" smerge-diff-base-lower)
      ("R" smerge-refine)
      ("E" smerge-ediff)
      ("C" smerge-combine-with-next)
      ("r" smerge-resolve)
      ("k" smerge-kill-current)
      ("ZZ" (lambda ()
              (interactive)
              (save-buffer)
              (bury-buffer))
       "Save and bury buffer" :color blue)
      ("q" nil "cancel" :color blue))
    :hook (magit-diff-visit-file . (lambda ()
                                     (when smerge-mode
                                       (unpackaged/smerge-hydra/body)))))

  (use-package vc
    :custom
    (vc-follow-symlinks t))
#+END_SRC

* Interface
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  ;; consistently ask yes or no questions
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; enabled region case manipulation commands
  (put 'upcase-region 'disabled nil)
  (put 'downcase-region 'disabled nil)
  ;; enable buffer narrowing commands
  (put 'narrow-to-region 'disabled nil)
  (put 'narrow-to-page 'disabled nil)
  (put 'narrow-to-defun 'disabled nil)

  (use-package crux
    :bind
    (("C-c D" . crux-delete-file-and-buffer)
     ("C-c I" . crux-find-user-init-file)
     ("C-c ," . crux-find-user-custom-file)
     ("C-c M-d" . crux-duplicate-and-comment-current-line-or-region)
     ("s-k" . crux-kill-whole-line)
     ([remap move-beginning-of-line] . crux-move-beginning-of-line))
    :commands
    (crux-capitalize-region
     crux-downcase-region
     crux-upcase-region
     crux-duplicate-and-comment-current-line-or-region
     crux-eval-and-replace))

  (use-package helpful
    :bind
    (("C-h f" . helpful-callable)
     ("C-h v" . helpful-variable)
     ("C-h k" . helpful-key)
     ("C-h C-d" . helpful-at-point)
     ("C-h F" . helpful-function)
     ("C-h C" . helpful-command))
    :custom
    (helpful-max-buffers 10))

  (use-package hydra
    :commands
    (defhydra))

  (use-package ns-win
    :straight (:type built-in)
    :if (eq system-type 'darwin)
    :custom
    (mac-command-modifier 'meta)
    (mac-option-modifier 'super))

  (use-package simple
    :straight (:type built-in)
    :bind
    ("C-x C-m" . execute-extended-command))

  (use-package which-key
    :config
    (which-key-mode))
#+END_SRC

* Navigation
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (setq
   ;; preserve the vertical position of the line containing the point
   scroll-preserve-screen-position t
   ;; never vertically recenter windows
   scroll-conservatively 100000
   scroll-margin 0)

  (use-package ace-link
    :config
    (ace-link-setup-default))

  (use-package ace-window
    :bind
    ("M-o" . ace-window)
    :custom
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

  (use-package avy
    :bind
    (("C-:" . avy-goto-char)
     ("C-'" . avy-goto-char-2)
     ("M-g f" . avy-goto-line)
     ("M-g w" . avy-goto-word-1)
     ("M-g e" . avy-goto-word-0))
    :commands
    (avy-goto-char-timer
     avy-org-goto-heading-timer
     avy-org-refile-as-child)
    :custom
    (avy-all-windows t)
    (avy-background t)
    (avy-case-fold-search t)
    (avy-timeout-seconds 0.8)
    (avy-dispatch-alist '((?x . avy-action-kill-move)
                          (?X . avy-action-kill-stay)
                          (?t . avy-action-teleport)
                          (?m . avy-action-mark)
                          (?n . avy-action-copy)
                          (?y . avy-action-yank)
                          (?Y . avy-action-yank-line)
                          (?i . avy-action-ispell)
                          (?z . avy-action-zap-to-char)))
    :config
    (avy-setup-default))

  (use-package avy-flycheck
    :bind
    ("C-c '" . avy-flycheck-goto-error))

  (use-package deadgrep
    :bind
    ("C-c h" . deadgrep)
    :commands
    (deadgrep-edit-mode
     deadgrep-kill-all-buffers))

  (use-package dired-sidebar
    :commands
    (dired-sidebar-toggle-sidebar)
    :custom
    (dired-sidebar-theme 'ascii))

  (use-package goto-chg
    :bind
    ("C-c G" . goto-last-change))

  (use-package ibuffer
    :bind
    ("C-x C-b" . ibuffer))

  (use-package imenu-anywhere
    :bind
    ("C-c i" . imenu-anywhere))

  (use-package recentf
    :custom
    (recentf-max-menu-items 25)
    (recentf-max-saved-items 250)
    :config
    (add-to-list 'recentf-exclude no-littering-var-directory)
    (add-to-list 'recentf-exclude no-littering-etc-directory)
    (recentf-mode 1))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package wgrep)
#+END_SRC

=save-place-mode= automatically saves the last location of the point in each visited file.
Visiting the file again will return the point to that location.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package saveplace
    :config
    (save-place-mode 1))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package subword
    :config
    (global-subword-mode))

  (use-package uniquify
    :straight (:type built-in)
    :custom
    (uniquify-buffer-name-style 'post-forward)
    (uniquify-after-kill-buffer-p t)
    (uniquify-ignore-buffers-re "^\\*"))
#+END_SRC

=winner-mode= tracks changes to the window configuration and makes them accessible via the following commands:
+ =winner-undo= (=C-c left=) switch to the previous window configuration
+ =winner-redo= (=C-c right=) restore the next most recent window configuration
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package winner
    :straight (:type built-in)
    :init
    (winner-mode))
#+END_SRC

