config.org
* Completion
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package consult
    :bind
    (("C-s" . consult-line)
     ("C-x b" . consult-buffer)
     ("C-x C-r" . consult-recent-file)
     ("M-g M-g" . consult-goto-line)
     ("C-c r" . consult-ripgrep))
    :custom
    (xref-show-xrefs-function #'consult-xref)
    (xref-show-definitions-function #'consult-xref)
    :commands
    (consult-yank-pop))
#+END_SRC

=corfu= facilitates in-buffer completions via a popup completion menu that is displayed near the point.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package corfu
    :straight (:files (:defaults "extensions/*"))
    :bind (:map corfu-map
                ("SPC" . corfu-insert-separator))
    :custom
    (corfu-auto t)
    (corfu-auto-delay 0.25)
    (corfu-auto-prefix 2)
    (corfu-cycle t)
    (corfu-quit-no-match t)
    :init
    (global-corfu-mode)
    :config
    (corfu-history-mode 1))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package embark
    :bind
    ("C-c a" . embark-act))

  (use-package embark-consult
    :ensure nil
    :after (embark consult))
#+END_SRC

The =marginalia= package add contextual annotations to minibuffer completion candidates.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package marginalia
    :defer 1
    :custom
    (marginalia-align 'left)
    (marginalia-max-relative-age 0)
    :config
    (marginalia-mode))
#+END_SRC

=orderless= is a completion style that treats a pattern as a series of components and matches candidates that match every component in any order.
The package provides various component matching styles, including literal, regexp, multiple word prefix and flex.
In addition, it implements a dispatch mechanism to alter the style dynamically as components are entered.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package orderless
    :preface
    (defun my-orderless-dispatch (pattern index total)
      (cond
       ((string= "!" pattern) `(orderless-literal . ""))
       ((string-prefix-p "!" pattern) `(orderless-without-literal . ,(substring pattern 1)))
       ((string-suffix-p "=" pattern) `(orderless-literal . ,(substring pattern 0 -1)))
       ((string-prefix-p "^" pattern) `(orderless-prefixes . ,(substring pattern 1)))
       ((= index 0) 'orderless-flex)))
    :custom
    (orderless-matching-styles '(orderless-literal orderless-regexp))
    (orderless-style-dispatchers '(my-orderless-dispatch))
    (completion-styles '(orderless))
    (completion-category-overrides '((file (styles basic partial-completion)))))
#+END_SRC

When enabled, =savehist-mode= periodically saves minibuffer history to a file.
Completion in the minibuffer orders completion candidates based on this history, prioritizing more recently used candidates.
The variable =savehist-file= defines the file name where the history is saved.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package savehist
    :straight (:type built-in)
    :defer 1
    :custom
    (savehist-autosave-interval (* 5 60))
    (savehist-save-minibuffer-history t)
    :config
    (savehist-mode)
    (add-to-list 'savehist-additional-variables 'corfu-history))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package vertico
    :straight (:files (:defaults "extensions/*"))
    :defer 1
    :hook
    (rfn-eshadow-update-overlay . vertico-directory-tidy)
    :custom
    (vertico-count 10)
    (vertico-cycle t)
    (vertico-resize 'grow-only)
    (vertico-scroll-margin 2)
    :config
    (vertico-mode))

  (use-package vertico-directory
    :straight nil
    :after vertico
    :bind (:map vertico-map
                ("RET" . vertico-directory-enter)
                ("DEL" . vertico-directory-delete-char)
                ("M-DEL" . vertico-directory-delete-word)))
#+END_SRC

The value of =tab-always-indent= affects the behavior of the TAB key.
When set to =complete=, TAB indents the current line unless it is already indented.
In this case, TAB runs =complete-at-point= to complete the thing at point.
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq tab-always-indent 'complete)
#+END_SRC

* Editing
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (setq-default
   indent-tabs-mode nil
   tab-width 4)

  (use-package abbrev
    :straight (:type built-in)
    :custom
    (abbrev-file-name (expand-file-name "abbreviations" user-emacs-directory))
    :config
    (setq-default abbrev-mode t)
    (quietly-read-abbrev-file abbrev-file-name))

  (use-package aggressive-indent
    :commands
    (aggressive-indent-mode))

  (use-package autoinsert
    :custom
    (auto-insert-alist nil)
    (auto-insert-query nil)
    :config
    (auto-insert-mode))
#+END_SRC

The =global-auto-revert-mode= mode reverts any buffer associated with a file when that file changes.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package autorevert
    :config
    (global-auto-revert-mode t))
#+END_SRC

=browse-kill-ring= displays items from the kill ring in a separate buffer.
Within that buffer, individual items can be selected and the source buffer will be updated as if =yank= was called for the selection.
The =RET= key commits to a selection of killed text, modifies the source buffer accordingly and closes the kill ring buffer.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package browse-kill-ring
    :bind
    ("C-x y" . browse-kill-ring))
#+END_SRC

When =delete-selection-mode= is enabled, typed text will replace an active selection.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package delsel
    :config
    (delete-selection-mode t))
#+END_SRC

The =edit-indirect-region= command enables editing of a region in a separate buffer, isolated from its surrounding text.
When done, the following commands can be used to exit the edit buffer:
+ =edit-indirect-commit= will replace the original region with the edited version
+ =edit-indirect-abort= will discard the modifications leaving the original region unmodified
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package edit-indirect
    :commands
    (edit-indirect-region))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package electric-operator
    :commands
    (electric-operator-mode
     electric-operator-get-rules-for-mode
     electric-operator-add-rules-for-mode))
#+END_SRC

The =expand-region= package provides commands for manipulating the region based on semantic units.
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package expand-region
    :bind
    ("C-=" . er/expand-region)
    :commands
    (er/expand-region
     er/contract-region))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package mouse
    :straight (:type built-in)
    :custom
    (mouse-yank-at-point t))

  (use-package move-text
    :commands
    (move-text-up
     move-text-down))

  (use-package multiple-cursors
    :bind
    (("C-S-c C-S-c" . mc/edit-lines)
     ("C->" . 'mc/mark-next-like-this)
     ("C-<" . 'mc/mark-previous-like-this)
     ("C-c C-<" . 'mc/mark-all-like-this))
    :commands
    (mc/edit-lines)
    :custom
    (mc/list-file (expand-file-name ".mc-lists.el" user-emacs-directory)))

  (use-package selected
    :commands
    (selected-minor-mode)
    :bind (:map selected-keymap
                ("=" . er/expand-region)
                ("-" . er/contract-region)
                ("a" . apply-macro-to-region-lines)
                ("y" . consult-yank-pop)
                ("w" . count-words-region)
                ("c" . crux-capitalize-region)
                ("l" . crux-downcase-region)
                ("u" . crux-upcase-region)
                ("d" . crux-duplicate-and-comment-current-line-or-region)
                ("e" . crux-eval-and-replace)
                ("p" . move-text-up)
                ("n" . move-text-down)
                ("m" . mc/edit-lines)
                ("q" . selected-off)
                ("w" . sp-kill-region)
                ("r" . sp-delete-region)
                ("/" . undo-tree-undo)))

  (use-package simple
    :straight (:type built-in)
    :custom
    (next-line-add-newlines t))

  ;; use a tree-structured representation of undo history
  (use-package undo-tree
    :commands
    (undo-tree-undo)
    :config
    (global-undo-tree-mode))

  ;; visualize unwanted whitespace characters and lines that are too long
  (use-package whitespace
    :commands
    (whitespace-cleanup)
    :custom
    (whitespace-line-column 100)
    (whitespace-style '(face tabs empty trailing lines-tail)))

  (use-package yasnippet
    :defer t
    :config
    (add-to-list 'yas-snippet-dirs (expand-file-name "snippets" user-emacs-directory))
    (yas-global-mode t))

  (use-package yatemplate
    :defer t
    :custom
    (yatemplate-dir (expand-file-name "templates" user-emacs-directory))
    :config
    (yatemplate-fill-alist))
#+END_SRC

* Writing
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package flyspell
    :commands
    (flyspell-mode
     flyspell-prog-mode))

  (use-package ispell
    :custom
    (ispell-personal-dictionary "~/.aspell.en.pws")
    (ispell-program-name "aspell"))

  (use-package text-mode
    :straight (:type built-in)
    :hook
    (text-mode . flyspell-mode))
#+END_SRC

* Programming
