config.el

;; [[file:config.org::*Completion][Completion:1]]
(use-package consult
  :bind
  (("C-s" . consult-line)
   ("C-x b" . consult-buffer)
   ("C-x C-r" . consult-recent-file)
   ("M-g M-g" . consult-goto-line))
  :custom
  (xref-show-xrefs-function #'consult-xref)
  (xref-show-definitions-function #'consult-xref)
  :commands
  (consult-yank-pop))

(use-package corfu
  :bind (:map corfu-map
              ("SPC" . corfu-insert-separator))
  :custom
  (corfu-cycle t)
  :init
  (global-corfu-mode))

(use-package marginalia
  :defer 1
  :custom
  (marginalia-align 'left)
  (marginalia-max-relative-age 0)
  :config
  (marginalia-mode))

(use-package orderless
  :preface
  (defun my-orderless-dispatch (pattern index total)
    (cond
     ((string= "!" pattern) `(orderless-literal . ""))
     ((string-prefix-p "!" pattern) `(orderless-without-literal . ,(substring pattern 1)))
     ((string-suffix-p "=" pattern) `(orderless-literal . ,(substring pattern 0 -1)))
     ((string-prefix-p "^" pattern) `(orderless-prefixes . ,(substring pattern 1)))
     ((= index 0) 'orderless-flex)))
  :custom
  (orderless-matching-styles '(orderless-literal orderless-regexp))
  (orderless-style-dispatchers '(my-orderless-dispatch))
  (completion-styles '(orderless))
  (completion-category-overrides '((file (styles basic partial-completion)))))

(use-package savehist
  :straight (:type built-in)
  :defer 1
  :config
  (savehist-mode))

(use-package vertico
  :straight (:files (:defaults "extensions/*"))
  :defer 1
  :custom
  (vertico-count 10)
  (vertico-cycle t)
  (vertico-resize 'grow-only)
  (vertico-scroll-margin 2)
  :config
  (vertico-mode))

(use-package vertico-directory
  :straight nil
  :after vertico
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word)))
;; Completion:1 ends here

(setq tab-always-indent 'complete)

;; [[file:config.org::*Editing][Editing:1]]
(setq-default
 indent-tabs-mode nil
 tab-width 4)

(use-package abbrev
  :straight (:type built-in)
  :custom
  (abbrev-file-name (expand-file-name "abbreviations" user-emacs-directory))
  :config
  (setq-default abbrev-mode t)
  (quietly-read-abbrev-file abbrev-file-name))

(use-package aggressive-indent
  :commands
  (aggressive-indent-mode))

(use-package autoinsert
  :custom
  (auto-insert-alist nil)
  (auto-insert-query nil)
  :config
  (auto-insert-mode))

(use-package autorevert
  :config
  (global-auto-revert-mode t))

(use-package browse-kill-ring
  :bind
  ("C-x y" . browse-kill-ring))

(use-package delsel
  :config
  (delete-selection-mode t))

(use-package edit-indirect
  :commands
  (edit-indirect-region))

(use-package electric-operator
  :commands
  (electric-operator-mode
   electric-operator-get-rules-for-mode
   electric-operator-add-rules-for-mode))

(use-package expand-region
  :bind
  ("C-=" . er/expand-region))

(use-package mouse
  :straight (:type built-in)
  :custom
  (mouse-yank-at-point t))

(use-package move-text
  :commands
  (move-text-up
   move-text-down))

(use-package multiple-cursors
  :bind
  (("C-S-c C-S-c" . mc/edit-lines)
   ("C->" . 'mc/mark-next-like-this)
   ("C-<" . 'mc/mark-previous-like-this)
   ("C-c C-<" . 'mc/mark-all-like-this))
  :commands
  (mc/edit-lines)
  :custom
  (mc/list-file (expand-file-name ".mc-lists.el" user-emacs-directory)))

(use-package selected
  :commands
  (selected-minor-mode)
  :bind (:map selected-keymap
              ("a" . apply-macro-to-region-lines)
              ("y" . consult-yank-pop)
              ("w" . count-words-region)
              ("c" . crux-capitalize-region)
              ("l" . crux-downcase-region)
              ("u" . crux-upcase-region)
              ("d" . crux-duplicate-and-comment-current-line-or-region)
              ("e" . crux-eval-and-replace)
              ("p" . move-text-up)
              ("n" . move-text-down)
              ("m" . mc/edit-lines)
              ("q" . selected-off)
              ("w" . sp-kill-region)
              ("r" . sp-delete-region)
              ("/" . undo-tree-undo)))

(use-package simple
  :straight (:type built-in)
  :custom
  (next-line-add-newlines t))

;; use a tree-structured representation of undo history
(use-package undo-tree
  :commands
  (undo-tree-undo)
  :config
  (global-undo-tree-mode))

;; visualize unwanted whitespace characters and lines that are too long
(use-package whitespace
  :commands
  (whitespace-cleanup)
  :custom
  (whitespace-line-column 100)
  (whitespace-style '(face tabs empty trailing lines-tail)))

(use-package yasnippet
  :defer t
  :config
  (add-to-list 'yas-snippet-dirs (expand-file-name "snippets" user-emacs-directory))
  (yas-global-mode t))

(use-package yatemplate
  :defer t
  :custom
  (yatemplate-dir (expand-file-name "templates" user-emacs-directory))
  :config
  (yatemplate-fill-alist))
;; Editing:1 ends here

(use-package flyspell
  :commands
  (flyspell-mode
   flyspell-prog-mode))

(use-package ispell
  :custom
  (ispell-personal-dictionary "~/.aspell.en.pws")
  (ispell-program-name "aspell"))

(use-package text-mode
  :straight (:type built-in)
  :hook
  (text-mode . flyspell-mode))
