config.org
** General
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package eglot
    :bind
    (:map eglot-mode-map
          ("C-c l r" . eglot-rename)))

  (use-package flycheck
    :bind
    (:map flycheck-mode-map
          ("C-c e n" . flycheck-next-error)
          ("C-c e p" . flycheck-previous-error))
    :custom
    (flycheck-buffer-switch-check-intermediate-buffers nil)
    (flycheck-check-syntax-automatically '(idle-buffer-switch idle-change mode-enabled save))
    (flycheck-highlighting-mode 'symbols)
    (flycheck-idle-buffer-switch-delay 2.0)
    (flycheck-idle-change-delay 2.0)
    (flycheck-indication-mode nil))

  (use-package flymake
    :bind
    (:map flymake-mode-map
          ("C-c e n" . flymake-goto-next-error)
          ("C-c e p" . flymake-goto-prev-error)
          ("C-c e d" . flymake-show-buffer-diagnostics)
          ("C-c e D" . flymake-show-project-diagnostics))
    :custom
    (flymake-fringe-indicator-position nil)
    (flymake-no-changes-timeout 1))

  (use-package lsp-mode
    :preface
    ;; https://github.com/minad/corfu/issues/41
    (defun my-lsp-passthrough-to-orderless ()
      "Replace lsp-passthrough completion style with orderless."
      (setcdr (cadr (assq 'lsp-capf completion-category-defaults)) '(orderless)))
    :commands
    (lsp
     lsp-deferred)
    :hook
    (lsp-mode . my-lsp-passthrough-to-orderless)
    :custom
    (lsp-auto-guess-root t)
    (lsp-completion-provider :none)
    (lsp-enable-indentation nil)
    (lsp-headerline-breadcrumb-enable nil)
    (lsp-keymap-prefix "C-c l")
    (lsp-lens-enable nil))

  (use-package lsp-pyright
    :defer t)

  (use-package prog-mode
    :straight (:type built-in)
    :hook
    ((prog-mode . flyspell-prog-mode)
     (prog-mode . rainbow-delimiters-mode)
     (prog-mode . turn-on-smartparens-strict-mode)))

  (use-package smartparens
    :defer t
    :commands
    (sp-kill-region
     sp-delete-region)
    :custom
    (sp-escape-quotes-after-insert nil)
    :config
    (require 'smartparens-config)
    (show-smartparens-global-mode +1))

  (use-package which-func
    :config
    (which-function-mode 1))
#+END_SRC

** Make
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package make-mode
    :mode
    ("Make.rules" . makefile-mode)
    :hook
    (makefile-mode . (lambda () (whitespace-toggle-options '(tabs)))))
#+END_SRC

** CMake
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package cmake-font-lock
    :commands
    (cmake-font-lock-activate))

  (use-package cmake-integration
    :straight (:host github :repo "darcamo/cmake-integration" :branch "main")
    :defer 1
    :commands
    (cmake-integration-cmake-reconfigure
     cmake-integration-cmake-configure-with-preset
     cmake-integration-save-and-compile
     cmake-integration-save-and-compile-last-target
     cmake-integration-run-last-target
     cmake-integration-run-last-target-with-arguments))

  (use-package cmake-mode
    :hook
    (cmake-mode . cmake-font-lock-activate))
#+END_SRC

** C/C++
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package ccls
    :custom
    (ccls-sem-highlight-method 'overlays))

  (use-package clang-format
    :commands
    (clang-format-region
     clang-format-buffer))

  (use-package cuda-mode
    :mode "\\.cuh?\\'")

  (use-package modern-cpp-font-lock
    :commands
    (modern-c++-font-lock-mode))
#+END_SRC

** Clojure
#+BEGIN_SRC emacs-lisp :tangle no :comments link
  (use-package cider
    :defer t)

  (use-package clojure-mode)
#+END_SRC

** Emacs Lisp
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package elisp-mode
    :straight (:type built-in)
    :hook
    ((emacs-lisp-mode . aggressive-indent-mode)
     (emacs-lisp-mode . electric-operator-mode))
    :config
    (electric-operator-add-rules-for-mode 'emacs-lisp-mode (cons "." " . ")))
#+END_SRC

** Go
#+BEGIN_SRC emacs-lisp :tangle no :comments link
  (use-package go-mode
    :hook
    (go-mode . (lambda ()
                 (setq tab-width 4)
                 (setq indent-tabs-mode 1)
                 (add-hook 'before-save-hook 'gofmt-before-save nil t))))
#+END_SRC

** Python
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package blacken
    :commands
    (blacken-buffer))

  (use-package pip-requirements
    :defer t
    :custom
    (pip-requirements-index-url nil))

  (use-package py-isort
    :commands
    (py-isort-before-save))

  (use-package python
    :hook
    (python-mode . highlight-indentation-mode))

  (use-package python-pytest
    :bind
    ("C-c t" . python-pytest)
    ("C-x t" . python-pytest-dispatch)
    :custom
    (python-pytest-unsaved-buffers-behavior 'save-all))
#+END_SRC

** Shell
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package sh-script
    :mode
    (("zshrc\\'" . sh-mode)
     (".zsh_personal\\'" . sh-mode)
     ("\\.zsh-theme\\'" . sh-mode)))
#+END_SRC

** Protocol Buffers
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package protobuf-mode
    :mode "\\.proto\\'"
    :hook
    ((protobuf-mode . flyspell-prog-mode)
     (protobuf-mode . electric-operator-mode))
    :config
    (electric-operator-add-rules-for-mode 'protobuf-mode (cons "=" " = ")))
#+END_SRC

** Embedded
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package arduino-mode
    :mode
    (("\\.ino\\'" . arduino-mode)
     ("\\.pde\\'" . arduino-mode)))

  (use-package platformio-mode
    :commands
    (platformio-mode
     platformio-conditionally-enable))
#+END_SRC

* Org
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package ob-emacs-lisp
    :straight nil
    :commands
    (org-babel-expand-body:emacs-lisp
     org-babel-execute:emacs-lisp))

  (use-package ob-http
    :commands
    (org-babel-expand-body:http
     org-babel-execute-body:http))

  (use-package ob-python
    :straight nil
    :commands
    (org-babel-execute:python))

  (use-package ob-shell
    :straight nil
    :commands
    (org-babel-execute:shell))

  (use-package org
    :defer t
    :custom
    (org-babel-load-languages nil)
    (org-confirm-babel-evaluate nil)
    (org-src-fontify-natively t)
    (org-use-speed-commands t))

  (use-package org-roam
    :defer t
    :custom
    (org-roam-directory (concat (getenv "HOME") "/Documents/notes/"))
    :config
    (org-roam-db-autosync-enable))

  (use-package ob-async
    :after org
    :defer t
    :custom
    (org-babel-load-languages
     '((C . t)
       (clojure . t)
       (emacs-lisp . t)
       (http . t)
       (python . t)
       (shell . t))))
#+END_SRC

* Dired
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package dired
    :straight (:type built-in)
    :custom
    (dired-auto-revert-buffer t)
    (dired-recursive-copies 'always)
    (dired-recursive-deletes 'always)
    :config
    (if (eq system-type 'darwin)
        (setq dired-use-ls-dired nil)))
#+END_SRC

* Docker
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package docker
    :bind
    ("C-c d" . docker))

  (use-package dockerfile-mode
    :defer t)

  (use-package docker-compose-mode
    :defer t)
#+END_SRC

* Files
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package ansible-doc
    :commands
    (ansible-doc))

  (use-package apt-sources-list
    :defer t)

  (use-package groovy-mode
    :defer t)

  (use-package i3wm-config-mode
    :straight (:host github :repo "Alexander-Miller/i3wm-Config-Mode" :branch "master")
    :commands
    (i3wm-config-mode))

  (use-package json-mode
    :mode
    ("Pipfile.lock\\'" . json-mode))

  (use-package ledger-mode
    :defer t)

  (use-package markdown-mode
    :mode
    (("README\\.md\\'" . gfm-mode)
     ("\\.md\\'" . markdown-mode)
     ("\\.markdown\\'" . markdown-mode)))

  (use-package markdown-preview-mode
    :defer t)

  ;; use ssh-specific modes for ssh configuration files
  (use-package ssh-config-mode
    :defer t)

  (use-package systemd
    :defer t)

  (use-package toml-mode
    :mode
    ("Pipfile\\'" . toml-mode)
    :hook
    (toml-mode . electric-operator-mode)
    :config
    (electric-operator-add-rules-for-mode 'toml-mode (cons "=" " = ")))

  (use-package udev-mode
    :defer t)

  (use-package yaml-mode
    :after docker-compose-mode
    :bind (:map yaml-mode-map ("C-c h a" . ansible-doc))
    :mode ("\\.yaml\\'" "\\.yml\\'" "group_vars/.+\\'")
    :hook (yaml-mode . flyspell-prog-mode))
#+END_SRC

