config.el

;; [[file:config.org::*General][General:1]]
(use-package flycheck
  :hook
  (after-init . global-flycheck-mode)
  :bind
  (("C-c e n" . flycheck-next-error)
   ("C-c e p" . flycheck-previous-error))
  :custom
  (flycheck-buffer-switch-check-intermediate-buffers nil)
  (flycheck-check-syntax-automatically '(idle-buffer-switch idle-change mode-enabled save))
  (flycheck-highlighting-mode 'symbols)
  (flycheck-idle-buffer-switch-delay 2.0)
  (flycheck-idle-change-delay 2.0)
  (flycheck-indication-mode nil))

(use-package lsp-mode
  :preface
  ;; https://github.com/minad/corfu/issues/41
  (defun my-lsp-passthrough-to-orderless ()
    "Replace lsp-passthrough completion style with orderless."
    (setcdr (cadr (assq 'lsp-capf completion-category-defaults)) '(orderless)))
  :commands
  (lsp
   lsp-deferred)
  :hook
  (lsp-mode . my-lsp-passthrough-to-orderless)
  :custom
  (lsp-auto-guess-root t)
  (lsp-completion-provider :none)
  (lsp-enable-indentation nil)
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-keymap-prefix "C-c l"))

(use-package lsp-pyright
  :defer t)

(use-package prog-mode
  :straight (:type built-in)
  :hook
  ((prog-mode . flyspell-prog-mode)
   (prog-mode . rainbow-delimiters-mode)
   (prog-mode . turn-on-smartparens-strict-mode)))

(use-package smartparens
  :defer t
  :commands
  (sp-kill-region
   sp-delete-region)
  :custom
  (sp-escape-quotes-after-insert nil)
  :config
  (require 'smartparens-config)
  (show-smartparens-global-mode +1))

(use-package which-func
  :config
  (which-function-mode 1))
;; General:1 ends here

;; [[file:config.org::*Make][Make:1]]
(use-package make-mode
  :mode
  ("Make.rules" . makefile-mode)
  :hook
  (makefile-mode . (lambda () (whitespace-toggle-options '(tabs)))))
;; Make:1 ends here

;; [[file:config.org::*CMake][CMake:1]]
(use-package cmake-font-lock
  :commands
  (cmake-font-lock-activate))

(use-package cmake-mode
  :hook
  (cmake-mode . cmake-font-lock-activate))
;; CMake:1 ends here

;; [[file:config.org::*Emacs Lisp][Emacs Lisp:1]]
(use-package elisp-mode
  :straight (:type built-in)
  :hook
  ((emacs-lisp-mode . aggressive-indent-mode)
   (emacs-lisp-mode . electric-operator-mode))
  :config
  (electric-operator-add-rules-for-mode 'emacs-lisp-mode (cons "." " . ")))
;; Emacs Lisp:1 ends here

;; [[file:config.org::*Python][Python:1]]
(use-package blacken
  :commands
  (blacken-buffer))

(use-package pip-requirements
  :defer t
  :custom
  (pip-requirements-index-url nil))

(use-package py-isort
  :commands
  (py-isort-before-save))

(use-package python
  :hook
  (python-mode . highlight-indentation-mode))

(use-package python-pytest
  :bind
  ("C-c t" . python-pytest)
  ("C-x t" . python-pytest-dispatch)
  :custom
  (python-pytest-unsaved-buffers-behavior 'save-all))
;; Python:1 ends here

;; [[file:config.org::*Shell][Shell:1]]
(use-package sh-script
  :mode
  (("zshrc\\'" . sh-mode)
   (".zsh_personal\\'" . sh-mode)
   ("\\.zsh-theme\\'" . sh-mode)))
;; Shell:1 ends here

;; [[file:config.org::*Protocol Buffers][Protocol Buffers:1]]
(use-package protobuf-mode
  :mode "\\.proto\\'"
  :hook
  ((protobuf-mode . flyspell-prog-mode)
   (protobuf-mode . electric-operator-mode))
  :config
  (electric-operator-add-rules-for-mode 'protobuf-mode (cons "=" " = ")))
;; Protocol Buffers:1 ends here

;; [[file:config.org::*Embedded][Embedded:1]]
(use-package arduino-mode
  :mode
  (("\\.ino\\'" . arduino-mode)
   ("\\.pde\\'" . arduino-mode)))

(use-package platformio-mode
  :commands
  (platformio-mode
   platformio-conditionally-enable))
;; Embedded:1 ends here

;; [[file:config.org::*Org][Org:1]]
(use-package ob-emacs-lisp
  :straight nil
  :commands
  (org-babel-expand-body:emacs-lisp
   org-babel-execute:emacs-lisp))

(use-package ob-http
  :commands
  (org-babel-expand-body:http
   org-babel-execute-body:http))

(use-package ob-python
  :straight nil
  :commands
  (org-babel-execute:python))

(use-package ob-shell
  :straight nil
  :commands
  (org-babel-execute:shell))

(use-package org
  :defer t
  :custom
  (org-babel-load-languages nil)
  (org-confirm-babel-evaluate nil)
  (org-src-fontify-natively t)
  (org-use-speed-commands t))

(use-package org-roam
  :defer t
  :custom
  (org-roam-directory (concat (getenv "HOME") "/Documents/notes/"))
  :config
  (org-roam-db-autosync-enable))

(use-package ob-async
  :after org
  :defer t
  :custom
  (org-babel-load-languages
   '((C . t)
     (clojure . t)
     (emacs-lisp . t)
     (http . t)
     (python . t)
     (shell . t))))
;; Org:1 ends here

;; [[file:config.org::*Dired][Dired:1]]
(use-package dired
  :straight (:type built-in)
  :custom
  (dired-auto-revert-buffer t)
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'always)
  :config
  (if (eq system-type 'darwin)
      (setq dired-use-ls-dired nil)))
;; Dired:1 ends here

;; [[file:config.org::*Docker][Docker:1]]
(use-package docker
  :bind
  ("C-c d" . docker))

(use-package dockerfile-mode
  :defer t)

(use-package docker-compose-mode
  :defer t)
;; Docker:1 ends here

;; [[file:config.org::*Files][Files:1]]
(use-package ansible-doc
  :commands
  (ansible-doc))

(use-package apt-sources-list
  :defer t)

(use-package conf-mode
  :mode
  ((".preseed$" . conf-mode)
   ("pylintrc$" . conf-mode)))

(use-package groovy-mode
  :defer t)

(use-package i3wm-config-mode
  :straight (:host github :repo "Alexander-Miller/i3wm-Config-Mode" :branch "master")
  :commands
  (i3wm-config-mode))

(use-package json-mode
  :mode
  ("Pipfile.lock\\'" . json-mode))

(use-package ledger-mode
  :defer t)

(use-package markdown-mode
  :mode
  (("README\\.md\\'" . gfm-mode)
   ("\\.md\\'" . markdown-mode)
   ("\\.markdown\\'" . markdown-mode)))

(use-package markdown-preview-mode
  :defer t)

;; use ssh-specific modes for ssh configuration files
(use-package ssh-config-mode
  :defer t)

(use-package systemd
  :defer t)

(use-package terraform-mode
  :defer t)

(use-package toml-mode
  :mode
  ("Pipfile\\'" . toml-mode)
  :hook
  (toml-mode . electric-operator-mode)
  :config
  (electric-operator-add-rules-for-mode 'toml-mode (cons "=" " = ")))

(use-package udev-mode
  :defer t)

(use-package yaml-mode
  :after docker-compose-mode
  :bind (:map yaml-mode-map ("C-c h a" . ansible-doc))
  :mode ("\\.yaml\\'" "\\.yml\\'" "group_vars/.+\\'")
  :hook (yaml-mode . flyspell-prog-mode))
;; Files:1 ends here
