config.org
* Functions
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (defun my-run-new-shell-always ()
    "Run a shell in a new buffer regardless of how many shells are already running."
    (interactive)
    (let ((shell-buffer-index 0)
          (shell-buffer-name-format "*shell-%d*")
          (shell-buffer-name))
      (while ;; loop until an unused shell buffer name is found
          (progn
            (setq shell-buffer-index (1+ shell-buffer-index))
            (setq shell-buffer-name (format shell-buffer-name-format shell-buffer-index))
            (get-buffer shell-buffer-name)))
      (shell shell-buffer-name)))

  (defun my-copy-filename-to-clipboard ()
    "Copy filename corresponding to the current buffer to clipboard."
    (interactive)
    (let ((filename (if (equal major-mode 'dired-mode)
                        default-directory
                      (buffer-file-name))))
      (when filename
        (kill-new filename))))
#+END_SRC

* Miscellaneous
#+BEGIN_SRC emacs-lisp :tangle yes :comments link
  (use-package comint
    :straight (:type built-in)
    :custom
    (comint-buffer-maximum-size 20000)
    (comint-process-echoes t))

  (use-package compile
    :hook
    (compilation-filter
     . (lambda ()
         (let ((inhibit-read-only t))
           (ansi-color-apply-on-region compilation-filter-start (point)))))
    :custom
    (compilation-ask-about-save nil)
    (compilation-scroll-output 'next-error)
    (compilation-environment '("TERM=eterm-color")))

  (use-package esup
    :commands
    (esup))

  (use-package files
    :straight (:type built-in)
    :hook
    (before-save . whitespace-cleanup)
    :custom
    (backup-by-copying t)
    (version-control t)
    (delete-old-versions t)
    (kept-new-versions 6)
    (kept-old-versions 2)
    (save-abbrevs 'silently)
    (require-final-newline t)
    (confirm-nonexistent-file-or-buffer nil))
#+END_SRC
